renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_rx_mcu.c
  #endif /* USB_CFG_DTC == USB_CFG_ENABLE */
#endif /* defined(BSP_MCU_RX62N) */


#if defined(BSP_MCU_RX630)
  #if USB_CFG_MODE == USB_CFG_HOST
    #error  Can not set USB_CFG_HOST to USB_CFG_MODE when using RX630 MCU in r_usb_basic_config.h.

  #endif /* USB_CFG_MODE == USB_CFG_HOST */

  #if USB_CFG_MODE == USB_CFG_HOST_PERI
    #error  Can not set USB_CFG_HOST_PERI to USB_CFG_MODE when using RX630 MCU in r_usb_basic_config.h.

  #endif /* USB_CFG_MODE == USB_CFG_HOST_PERI */

  #if defined(USB_CFG_HCDC_USE) || defined(USB_CFG_HHID_USE) || defined(USB_CFG_HMSC_USE) || defined(USB_CFG_HVNDR_USE)
    #error  Can not enable these definitions(USB_CFG_HCDC_USE/USB_CFG_HHID_USE/USB_CFG_HMSC_USE/USB_CFG_HVNDR_USE) \
        when using RX630 MCU in r_usb_basic_config.h.

  #endif /* defined(USB_CFG_HCDC_USE || USB_CFG_HHID_USE || USB_CFG_HMSC_USE || USB_CFG_HVNDR_USE) */
#endif /* defined(BSP_MCU_RX630) */


#if defined(BSP_MCU_RX63T)
  #if (USB_CFG_USE_USBIP == USB_CFG_IP1) || (USB_CFG_USE_USBIP == USB_CFG_MULTI)
    #error  Can not set USB_CFG_IP1/USB_CFG_MULTI to USB_CFG_USE_USBIP when using RX63T MCU in r_usb_basic_config.h.

  #endif /* (USB_CFG_USE_USBIP == USB_CFG_IP1) || (USB_CFG_USE_USBIP == USB_CFG_MULTI) */
#endif /* defined(BSP_MCU_RX63T) */


#if !defined(BSP_MCU_RX71M)
  #if USB_CFG_ELECTRICAL == USB_CFG_ENABLE
    #error  Can not set USB_CFG_ENABLE to USB_CFG_ELECTRICAL when using MCU other than RX71M in r_usb_basic_config.h.
  #endif /* USB_CFG_ELECTRICAL == USB_CFG_ENABLE */

#endif /* !defined(BSP_MCU_RX71M) */


/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/


/******************************************************************************
 Private global variables and functions
 ******************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(usbfs_usbi_isr, VECT(USB0, USBI0))

#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    R_BSP_PRAGMA_STATIC_INTERRUPT(usbhs_usbir_isr, VECT(USBA, USBAR))

#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) || defined (BSP_MCU_RX630) || defined (BSP_MCU_RX63T)
    R_BSP_PRAGMA_STATIC_INTERRUPT(usb_cpu_usb_int_hand_isr, VECT(USB, USBR0))
#endif /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) || defined (BSP_MCU_RX630) || defined (BSP_MCU_RX63T) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        R_BSP_PRAGMA_STATIC_INTERRUPT(usbhs_usbir_isr, VECT(USB1, USBI1))
    #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        R_BSP_PRAGMA_INTERRUPT(usb2_cpu_usb_int_hand_isr, VECT(USB, USBR1))
    #endif /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */
#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M)
    #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        R_BSP_PRAGMA_STATIC_INTERRUPT(usb_cpu_usb_int_hand_isr, VECT(USB0, USBR0))
    #endif /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */
#endif /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M) */

#if USB_CFG_DTC == USB_CFG_ENABLE
R_BSP_PRAGMA_STATIC_INTERRUPT(usb_cpu_d0fifo_int_hand, VECT(USB0, D0FIFO0))
R_BSP_PRAGMA_STATIC_INTERRUPT(usb_cpu_d1fifo_int_hand, VECT(USB0, D1FIFO0))

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
R_BSP_PRAGMA_STATIC_INTERRUPT(usb2_cpu_d0fifo_int_hand, VECT(USBA, D0FIFO2))
R_BSP_PRAGMA_STATIC_INTERRUPT(usb2_cpu_d1fifo_int_hand, VECT(USBA, D1FIFO2))

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined(BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
R_BSP_PRAGMA_INTERRUPT(usb2_cpu_d0fifo_int_hand, VECT(USB1, D0FIFO1))
R_BSP_PRAGMA_INTERRUPT(usb2_cpu_d1fifo_int_hand, VECT(USB1, D1FIFO1))

#endif  /* defined(BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

#endif  /* USB_CFG_DTC == USB_CFG_ENABLE */

/******************************************************************************
 Renesas Abstracted RSK functions
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_module_start
 Description     : USB module start
 Arguments       : uint8_t ip_type  : USB_IP0/USB_IP1
 Return value    : none
 ******************************************************************************/
usb_err_t usb_module_start (uint8_t ip_type)
{

    if (USB_IP0 == ip_type)
    {
        if (0 == MSTP(USB0))
        {
            return USB_ERR_BUSY;
        }

#if defined (BSP_MCU_RX72T)
        R_BSP_VoltageLevelSetting (BSP_VOL_USB_POWERON);
#endif  /* defined (BSP_MCU_RX72T) */

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

        /* Enable power for USB0 */
        MSTP(USB0) = 0;

        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    }
    else
    {
#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        if (0 == MSTP(USBA))
        {
            return USB_ERR_BUSY;
        }

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

        /* Enable power for USBA */
        MSTP(USBA) = 0;

        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        if (0 == MSTP(USB1))
        {
            return USB_ERR_BUSY;
        }

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

        /* Enable power for USB1 */
        MSTP(USB1) = 0;

        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

