renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_rx_mcu.c
#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        R_BSP_InterruptRequestEnable(VECT(USB, USBR0)); /* USBR0 enable */

#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

        /* Interrupt priority register
         b3-b0 IPR      Interrupt priority
         b7-b4 Reserved 0
         */
#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M)
        IPR (USB0, USBR0)= 0x00; /* USBR0 */

#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        IPR (USB, USBR0) = 0x00; /* USBR0 */

#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

        IPR (USB0, USBI0) = USB_CFG_INTERRUPT_PRIORITY; /* USBI0 in vector 128 */
        R_BSP_InterruptRequestEnable(VECT(USB0, USBI0)); /* USBI0 enable in vector 128 */
    }

    if (USB_IP1 == ip_type)
    {
#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        /* Interrupt enable register
         b0 IEN0 Interrupt enable bit
         b1 IEN1 Interrupt enable bit
         b2 IEN2 Interrupt enable bit
         b3 IEN3 Interrupt enable bit
         b4 IEN4 Interrupt enable bit
         b5 IEN5 Interrupt enable bit
         b6 IEN6 Interrupt enable bit
         b7 IEN7 Interrupt enable bit
         */
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))
        R_BSP_InterruptRequestEnable(VECT(USBA, D0FIFO2));   /* Enable D0FIF2 interrupt */
        R_BSP_InterruptRequestEnable(VECT(USBA, D1FIFO2));   /* Enable D1FIF2 interrupt */

#endif  /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */

        R_BSP_InterruptRequestEnable(VECT(USBA, USBAR)); /* Enable  USBA  interrupt */

        /* Priority D0FIFO0=0(Disable)
         b3-b0 IPR      Interrupt priority
         b7-b4 Reserved 0
         */
        IPR (USBA, USBAR) = USB_CFG_INTERRUPT_PRIORITY; /* USBA */

#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined(BSP_MCU_RX62N)
        /* Deep standby USB monitor register
        b0      SRPC0    USB0 single end control
        b3-b1   Reserved 0
        b4      FIXPHY0  USB0 transceiver output fix
        b7-b5   Reserved 0
        b8      SRPC1    USB1 single end control
        b11-b9  Reserved 0
        b12     FIXPHY1  USB1 transceiver output fix
        b15-b13 Reserved 0
        b16     DP0      USB0 DP input
        b17     DM0      USB0 DM input
        b19-b18 Reserved 0
        b20     DOVCA0   USB0 OVRCURA input
        b21     DOVCB0   USB0 OVRCURB input
        b22     Reserved 0
        b23     DVBSTS0  USB1 VBUS input
        b24     DP1      USB1 DP input
        b25     DM1      USB1 DM input
        b27-b26 Reserved 0
        b28     DOVCA1   USB1 OVRCURA input
        b29     DOVCB1   USB1 OVRCURB input
        b30     Reserved 0
        b31     DVBSTS1  USB1 VBUS input
        */
        USB.DPUSR0R.BIT.FIXPHY1 = 0u;   /* USB1 Transceiver Output fixed */

#endif /* defined(BSP_MCU_RX62N) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        /* Interrupt enable register
         b0 IEN0 Interrupt enable bit
         b1 IEN1 Interrupt enable bit
         b2 IEN2 Interrupt enable bit
         b3 IEN3 Interrupt enable bit
         b4 IEN4 Interrupt enable bit
         b5 IEN5 Interrupt enable bit
         b6 IEN6 Interrupt enable bit
         b7 IEN7 Interrupt enable bit
         */
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))
        R_BSP_InterruptRequestEnable(VECT(USB1, D0FIFO1));   /* Enable D0FIF1 interrupt */
        R_BSP_InterruptRequestEnable(VECT(USB1, D1FIFO1));   /* Enable D1FIF1 interrupt */

#endif  /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */

        R_BSP_InterruptRequestEnable(VECT(USB1, USBI1)); /* Enable  USB1  interrupt */
        R_BSP_InterruptRequestEnable(VECT(USB, USBR1)); /* Enable  USB1  interrupt */

        /* Priority D0FIFO0=0(Disable)
         b3-b0 IPR      Interrupt priority
         b7-b4 Reserved 0
         */
        IPR (USB1, USBI1) = USB_CFG_INTERRUPT_PRIORITY; /* USB1 */
        IPR (USB, USBR1) = USB_CFG_INTERRUPT_PRIORITY; /* USB1 */

#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

    }
}
/******************************************************************************
 End of function usb_cpu_usbint_init
 ******************************************************************************/

/******************************************************************************
 TIMER function
 ******************************************************************************/
/******************************************************************************
 Function Name   : usb_cpu_delay_1us
 Description     : 1us Delay timer
 Arguments       : uint16_t  time        ; Delay time(*1us)
 Return value    : none
 Note            : Please change for your MCU
 ******************************************************************************/
void usb_cpu_delay_1us (uint16_t time)
{
    R_BSP_SoftwareDelay((uint32_t)time, BSP_DELAY_MICROSECS);
}
/******************************************************************************
 End of function usb_cpu_delay_1us
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cpu_delay_xms
 Description     : xms Delay timer
 Arguments       : uint16_t  time        ; Delay time(*1ms)
 Return value    : void
 Note            : Please change for your MCU
 ******************************************************************************/
void usb_cpu_delay_xms (uint16_t time)
{
#if (BSP_CFG_RTOS_USED == 0)
    R_BSP_SoftwareDelay((uint32_t)time, BSP_DELAY_MILLISECS);
#endif /* (BSP_CFG_RTOS_USED == 0) */

#if (BSP_CFG_RTOS_USED == 1)
    vTaskDelay((TickType_t)(time/portTICK_PERIOD_MS));
#endif /* (BSP_CFG_RTOS_USED == 1) */
}
/******************************************************************************
 End of function usb_cpu_delay_xms
 ******************************************************************************/

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
/******************************************************************************
 Function Name   : usb_cpu_int_enable
 Description     : USB Interrupt Enable
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_cpu_int_enable (void)
{
    /* Interrupt enable register (USB0 USBIO enable)
     b0 IEN0 Interrupt enable bit
     b1 IEN1 Interrupt enable bit
     b2 IEN2 Interrupt enable bit
     b3 IEN3 Interrupt enable bit
     b4 IEN4 Interrupt enable bit
     b5 IEN5 Interrupt enable bit
     b6 IEN6 Interrupt enable bit
     b7 IEN7 Interrupt enable bit
     */
    R_BSP_InterruptRequestEnable(VECT(USB0, USBI0)); /* Enable USB0 interrupt */

#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    /* Interrupt enable register (USB1 USBIO enable)
     b0 IEN0 Interrupt enable bit
     b1 IEN1 Interrupt enable bit
     b2 IEN2 Interrupt enable bit
     b3 IEN3 Interrupt enable bit
     b4 IEN4 Interrupt enable bit
     b5 IEN5 Interrupt enable bit
     b6 IEN6 Interrupt enable bit
     b7 IEN7 Interrupt enable bit
     */
    R_BSP_InterruptRequestEnable(VECT(USBA, USBAR)); /* Enable USBA interrupt */

#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

